# Задание 2: Приветствие сотрудника

# Запрос данных у пользователя
name = input("Введите ваше имя: ")
city = input("Введите название города: ")

# Вывод с f-строкой
print(f"Сотрудник {name} работает в офисе {city}")
